CBL TEST
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE2.
      *****************************************************************
      *                                                               *
      *   Test program                                                *
      *                                                               *
      *****************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       PROCEDURE DIVISION.
       0001-MAIN.
           DISPLAY 'HELLO WORLD!'.
           GOBACK.
       END PROGRAM SAMPLE2.